    Вопросы и упражнения для самопроверки

    -- Вопросы:
1.	Почему в Java для каждого примитивного типа строго определен диапазон и поведение?

    -- Мой ответ (5): Для переносимости кода от версии к версии, int одинаково работает как в самом первом,
                      так и в самой последней версии виртуальной машины.

    -- Ответ по книге: Диапазон и поведение примитивных типов в Java строго определяются для
                       того, чтобы обеспечить переносимость между платформами.

2.	Что такое символьный тип в Java и чем он отличается от символьного типа,
    используемого в ряде других языков программирования?

    -- Мой ответ(0): Разработчики Java решили что в нем они не будут использовать числа без знаков,
                     в других языках допускаются числа без отрицательного знака.

    -- Ответ по книге: Символьным типом в Java является char. Для представления символов в
                       Java используется кодировка Unicode, а не ASCII, как в ряде других языков
                       программирования.

3.	Переменная типа boolean может иметь любое желаемое значение, потому что
    любое ненулевое значение является истинным. Так ли это?

    -- Мой ответ(5): нет, она может быть только true/false.

    -- Ответ по книге: Нет, не так. Значением boolean должно быть либо true, либо false.

4.	Что не так с этим фрагментом кода? --
    for(i = 0; i < 10; i++) {
    int sum;
    sum = sum + i;
    }
    System.out.println("Сумма; " + sum);

    -- Мой ответ(4): не объявлена и инициализирована переменная i,
                    переменная sum объявлена внутри и не проинициализирована,
                    по этому не видна снаружи блока.
                    После "Сумма" стоит знак ";" вместо ":".

    -- Ответ по книге: В этом фрагменте кода присутствуют две фундаментальные ошибки. Во-первых,
                       переменная sum создается каждый раз при входе в блок, определяемый циклом for,
                       и уничтожается при выходе из него. Таким образом, она
                       не будет сохранять свое значение между итерациями. Попытка использовать
                       sum для хранения текущей суммы итераций бессмысленна. Во-вторых, переменная
                       sum не будет известной за пределами блока, в котором она объявлена.
                       Таким образом, ссылка на нее в операторе println() недействительна.

5.	Объясните разницу между префиксной и постфиксной формами операции инкремента.

    -- Мой ответ(3): если инкремент используется как часть другого условия то префикс будет
                    выполнен с новым значением префикса, а постфикс со значением до инкремента и только
                    после него будет выполнен инкремент.

    -- Ответ по книге: Когда операция инкремента предшествует своему операнду, тогда инкриминирование
                       будет выполняться до получения значения операнда с целью
                       использования в остальной части выражения. Если операция инкремента
                       находится после своего операнда, то значение операнда будет получено перед инкриминированием.

6.	Когда в общем случае необходимо приведение?

    -- Мой ответ(0): не понял вопроса.

    -- Ответ по книге: Приведение необходимо в случае преобразования между несовместимыми
                       типами или при сужающем преобразовании.

7.	Влияют ли избыточные круглые скобки на скорость выполнения программы?

    -- Мой ответ(5): нет, они не влияют.

    -- Ответ по книге: Нет.

8.	Определяет ли блок область видимости?

    -- Мой ответ(5): да, но нельзя называть переменные одинаково как внутри, так и снаружи.

    -- Ответ по книге: Да.

9.	До какого типа повышаются типы byte и short в выражении?

    -- Мой ответ(0): до long.

    -- Ответ по книге: Типы byte и short в выражении повышаются до типа int.

    -- Упражнения:
10.	Напишите программу, находящую все простые числа от 2 до 100.

    -- Решение: Не смог выполнить.

11.	Напишите одиночный оператор println(), выдающий такой вывод:
    Один
    Два
    Три
    Напишите строку кода с вызовом метода println(), где этот результат выводится в виде одной строки.

    -- Решение(5): $_02_PrintLn

12.	Покажите, как можно использовать короткозамкнутую операцию И
    для предотвращения ошибки деления на ноль.

    -- Решение(5): $_04_Short_Circuit_Operation